## Importing libraries

In [1]:
import numpy as np
import pandas as pd

## Loading in data

In [2]:
data = pd.read_csv('Income Tet.csv')

In [3]:
data.head()

  Annual income
0     62,000.00
1     64,000.00
2     49,000.00
3    324,000.00
4  1,264,000.00

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 1 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Annual income  11 non-null     object
dtypes: object(1)
memory usage: 216.0+ bytes

## Data cleaning

In [5]:
data['Annual income'] = data['Annual income'].str.replace(',','')

In [6]:
data.head()

  Annual income
0      62000.00
1      64000.00
2      49000.00
3     324000.00
4    1264000.00

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 1 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Annual income  11 non-null     object
dtypes: object(1)
memory usage: 216.0+ bytes

In [8]:
data['Annual income'] = pd.to_numeric(data['Annual income'])

In [9]:
data.head()

   Annual income
0        62000.0
1        64000.0
2        49000.0
3       324000.0
4      1264000.0

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 1 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Annual income  11 non-null     float64
dtypes: float64(1)
memory usage: 216.0 bytes

## Calculating mean (arithmatic mean), median and mode using Pandas

In [11]:
data.mean()

Annual income    189848.181818
dtype: float64

In [12]:
data.median()

Annual income    55000.0
dtype: float64

In [13]:
#data.mode()
print(data.mode())

   Annual income
0        64000.0